package Z8集合;

/**1、集合概述
 * 1.1、什么是集合？有什么用？数组其实就是一个集合。集合实际上就是一个容器。
 * 可以来容纳其它类型的数据。集合为什么说在开发中使用较多？
 * 集合是一个容器，是一个载体，可以一次容纳多个对象。
 * 在实际开发中，假设连接数据库，数据库当中有10条记录，那么假设把这10条记录查询出来，
 * 在java程序中会将10条数据封装成10个java对象,然后将10个java对象放到某一个集合当中,将集合传到前端,然后遍历
 * 集合,将数据一个一个展现出来.
 * 1.2、集合不能直接存储基本数据类型，另外集合也不能直接存储java对象，集合当中存储的都是java对象的内存地址
 * 1.3、集合类都在java.util.*;
 * 1.4、在java中集合分为两大类:
 *   一类是单个方式存储元素:单个方式存储元素,这一类集合中超级父类接口:java.util.Collection;
 *   一类是以键值对的方式存储元素:以键值对的方式,这一类集合超级父类接口:java.util.Map;
 * 1.5 Collection有两个主要子接口:List接口和Set接口
 * List集合有序可重复,存储的元素有下标  Set集合无序不可重复,存储的元素没有下标
 * 1.6 List接口常用实现类有ArrayList,LinkedList,Vector.
 *     Set接口常用实现类有HashSet,TreeSet
 *
 */
public class Muster {
}
